able 2
above 3
absolutely 3
access 3
accessories 3
according 4
affordable 2
almost 2
aluminium 2
amazed 2
amazing 11
amazingly 3
amazon 2
android 4
angles 5
anything 2
app 2
application 2
applications 2
apps 7
attractive 2
audio 6
available 3
average 11
awesome 50
back-up 2
backup 27
bad 3
battery 91
beautiful 3
been 6
best 23
better 18
big 4
bit 4
body 5
both 9
branded 2
brands 2
bright 3
brightness 4
brilliant 6
budget 9
build 21
built 8
butter 2
buttery 5
button 2
buy 5
buying 4
cable 2
call 17
calling 2
calls 2
cam 4
camera 114
camera- 2
cameras 4
cant 2
capacity 2
card 2
care 2
charge 6
charger 2
charging 12
clarity 10
class 3
clear 15
clicks 3
close 2
coating 2
colour 6
colours 2
comes 8
comfortable 4
company 2
compare 2
compete 2
competitive 2
complaints 3
compromises 2
configuration 2
connectivity 6
contacts 2
continuously 2
convenient 2
cool 11
coolpad 5
core 2
cost 2
cover 8
crisp 7
crystal 2
current 2
customers 2
daylight 3
deal 2
decent 22
decision 2
definitely 3
delivery 4
descent 2
design 19
device 10
didnt 2
dirt 2
dirty 2
disappoint 2
disappointed 2
display 51
displays 2
does 5
doesnt 4
dont 3
double 2
drawback 3
dual 3
due 2
each 2
ear 4
earphones 3
easily 3
easy 5
efficient 2
end 5
enough 3
especially 2
ever 5
every 3
everything 9
excellent 41
except 4
expect 3
expectations 3
expected 4
experience 8
extremely 8
fall 2
fancy 2
fantastic 3
far 7
fast 31
faster 2
feature 4
features 20
feel 7
feels 8
find 2
fine 7
finger 14
fingerprint 16
finish 2
fit 2
fits 5
flash 3
found 2
free 6
front 24
full 9
games 6
gaming 5
gb 3
genuine 2
getting 3
given 2
gives 11
giving 3
glass 4
glitches 2
good 285
goodmacro 2
gorgeous 3
got 5
graphics 2
great 42
grip 2
guard 5
guys 2
had 5
half 4
hand 11
handle 2
handy 6
hang 3
hanging 2
hangs 3
happy 4
hardware 5
has 24
having 3
hd 6
headphones 2
headset 5
heat 3
heated 2
heating 16
heats 2
heavy 2
high 13
highly 2
hold 9
honor 2
hot 2
hours 2
however 2
im 3
images 4
impressive 3
inbuilt 2
inch 5
indeed 2
interface 2
internet 5
issue 4
issues 8
keeping 2
kind 4
lag 15
lagging 4
lags 12
large 2
last 2
lasting 3
lasts 5
led 3
less 5
level 2
life 19
light 25
like 19
liked 4
little 5
lock 3
lol 2
long 12
looking 6
looks 25
lot 2
lots 2
loud 10
love 3
loved 5
low 12
made 3
make 6
makes 3
management 2
mark 2
massive 2
memory 3
metal 4
minor 3
minutes 2
mobile 32
mode 3
model 4
moderate 5
money 5
more 12
mp 8
much 10
multitasking 6
multiwindow 2
music 6
nd 2
need 2
network 4
never 3
nice 30
nicely 2
night 3
nights 2
no 55
normal 3
not 35
notch 2
nothing 2
octa 2
off 2
offered 2
oil 2
ok 8
online 2
open 3
opened 2
operation 3
option 4
otg 3
others 2
outdoor 3
output 4
outstanding 3
overall 8
package 3
packed 2
palm 2
panel 2
par 2
part 2
people 2
perfect 9
perfectly 4
performance 39
phone 128
phones 10
photos 4
picture 2
pictures 5
pixel 2
playing 3
point 3
poor 2
power 7
premium 18
pretty 6
price 57
print 11
problem 11
problems 3
processing 4
processor 14
product 19
provided 3
providing 3
purchase 2
purchased 2
quality 96
quick 8
quite 8
ram 5
range 12
really 26
rear 19
recording 3
redmi 2
remote 2
reproduction 5
resistance 2
resistant 3
resolution 6
response 4
responsive 3
rocker 2
running 2
runs 2
satisfactory 2
satisfied 7
scanner 10
scratch 5
scratches 2
screen 34
second 4
seems 6
segment 2
selfie 2
sensitivity 2
sensor 16
service 2
settings 2
sexy 2
sharp 5
shots 7
should 4
side 3
signal 3
sim 3
simply 3
sims 2
since 2
size 5
sleek 8
slim 10
smart 3
smooth 32
smoothly 6
soft 4
software 3
softwares 2
solid 2
sound 34
speaker 8
speakers 5
spec 2
specially 2
specifications 3
specs 2
speed 10
strength 2
strong 2
stunning 4
sturdy 5
stylish 4
such 2
super 21
superb 28
support 4
take 2
takes 7
thank 2
thanks 4
thing 6
though 6
through 2
time 10
too 14
top 2
top-notch 2
touch 39
tough 3
tried 2
ui 22
unbeatable 2
under 5
upto 2
usage 2
used 7
useful 3
user 2
using 11
value 6
version 2
very 118
vibrant 2
video 11
viewing 5
vivid 3
voice 3
volume 6
wake 2
water 4
weight 12
weighted 2
were 3
whatsoever 3
while 6
white 2
wifi 2
wise 3
within 2
without 6
working 11
works 11
worth 4
zen 2
zoom 2
