able 7
again 3
allow 2
allowed 2
already 2
although 2
always 6
amazon 2
android 7
angle 2
another 2
anything 3
apart 3
app 9
appearing 2
application 4
applications 3
apps 9
area 2
around 2
audible 3
audio 5
auto 2
automatically 15
available 7
average 14
backup 11
bad 41
barely 2
battery 71
becomes 2
been 2
before 2
behaving 2
below 2
best 2
better 8
between 2
big 5
biggest 3
bloatware 2
blurred 5
blurry 4
both 5
bottom 2
bought 3
box 7
brands 2
bright 2
brightness 4
bugs 4
build 5
built 2
bulky 2
buttons 3
buy 11
buying 5
call 23
calling 3
calls 9
came 3
camera 69
cameras 2
cannot 2
cant 11
car 2
card 10
care 3
center 2
centre 2
charge 4
charged 2
charger 11
charging 17
cheap 11
chinese 2
claims 2
clarity 5
clear 4
clearly 4
colours 2
coming 4
compared 7
complete 2
condition 4
conditions 4
connect 3
connecting 2
connectivity 2
coolpad 6
cost 2
cover 2
cracked 4
custom 2
customer 2
damaged 2
dark 2
data 6
daylight 2
days 14
dead 2
default 4
defective 3
deg 2
device 8
didnt 2
difficult 3
directional 2
disappointed 8
disappointment 3
discharge 2
discharging 2
disliked 2
display 14
does 7
doesnt 4
dont 21
down 6
drain 5
drained 2
draining 8
drains 12
drop 3
due 6
dull 4
during 9
ear 4
earphone 2
earpiece 2
ears 2
end 5
especially 2
every 4
excessive 2
expectations 4
expected 7
experience 4
extremely 3
facing 5
faint 2
far 2
fast 21
faster 5
fastly 3
feature 2
features 4
feel 4
felt 2
few 6
find 2
fine 5
finger 3
finish 3
flash 6
flickering 2
found 6
frequent 4
front 7
full 4
fully 2
function 2
game 5
games 8
gb 5
gets 14
getting 20
gift 2
glass 2
glossy 3
good 51
got 17
grainy 3
great 2
guide 3
had 4
hand 4
handset 3
hang 10
hanged 3
hanging 12
hangs 10
happy 3
hard 2
has 10
having 4
headache 2
headphone 2
headset 2
hear 5
heat 11
heated 18
heating 38
heats 10
heavy 4
hence 2
high 7
highly 2
hold 3
horrible 4
hot 6
hours 7
however 4
icons 2
ignored 2
image 3
images 4
inbuilt 2
indoor 3
inr 3
installation 2
installed 2
installing 2
internal 3
internet 9
irritating 3
isnt 2
issue 15
issues 12
item 2
itself 2
keeps 3
kept 2
lack 2
lag 2
lagging 2
laggy 2
lags 4
last 6
less 2
life 4
light 9
lighting 2
like 15
line 3
little 5
location 3
lollipop 3
looks 5
lot 10
lots 2
loud 2
love 2
low 22
made 3
main 3
major 2
make 3
makes 3
manually 2
many 8
mark 2
maximum 2
mb 2
memory 7
mentioned 2
mic 3
micromax 3
microphone 3
middle 2
minutes 8
miss 2
mobile 29
mobiles 3
mode 2
money 13
month 4
months 6
more 10
move 5
mp 5
much 15
music 2
need 7
needs 2
net 4
network 13
new 4
next 2
night 5
no 37
normal 8
not 127
off 10
ok 5
old 3
online 2
option 8
order 2
otg 2
others 2
output 2
overheating 4
panel 3
particularly 2
pathetic 4
pay 2
people 5
per 5
performance 12
person 2
phone 144
phones 2
photos 2
pic 2
pictures 8
piece 3
plastic 4
play 6
playing 8
please 8
poor 43
premium 3
pretty 4
price 8
print 3
problem 26
problems 13
processing 3
processor 3
product 31
proper 5
properly 12
proximity 2
purchase 5
purchased 2
purpose 2
put 5
quality 63
quickly 7
ram 6
ready 3
really 7
rear 8
reason 2
reboot 3
received 2
receiving 3
recommended 2
recording 2
regret 2
repair 3
replace 3
replacement 5
requested 2
reset 2
resolution 3
response 4
restart 3
return 6
returned 3
rings 4
ringtone 5
sar 3
satisfied 4
screen 31
sd 7
second 2
seconds 2
sensor 4
serve 2
service 6
set 4
setting 2
severe 2
showing 3
side 5
signal 7
signals 3
sim 12
since 2
single 2
six 2
skin 2
slot 2
slow 19
sluggish 2
small 2
smart 3
soft 2
software 7
solved 2
someone 2
something 3
sometimes 5
sound 17
space 3
speaker 12
speakers 2
specification 3
speed 5
st 3
stand 2
started 7
starts 3
still 4
stopped 2
storage 3
strength 3
strengths 2
such 2
sucks 4
sudden 2
sun 3
supplied 2
support 4
supported 3
switch 3
switched 3
take 6
takes 4
talk 3
talking 2
temperature 2
terrible 5
terribly 2
theres 2
thin 2
thing 6
though 4
till 2
time 19
times 14
today 3
told 2
too 28
top 3
touch 25
touchscreen 3
transfer 2
tried 5
twice 3
ui 9
unable 2
unbearable 4
uncomfortable 2
under 3
unless 2
update 4
upto 4
usage 6
used 4
useless 2
user 2
using 26
value 6
version 2
vertical 2
very 97
video 5
voice 13
volume 10
wait 2
wanted 3
waste 8
wasted 2
weak 3
were 3
while 24
white 2
why 2
wifi 6
within 11
without 4
wont 3
working 33
worse 2
worst 18
worth 4
wrong 2
yellowish 2
